GREETING_MESS = (
    "👋 *Привет!* 👋\n🤖 Я бот, который может *генерировать тесты* по различным предметам и темам.\n\n"
    "📚 *Выберите предмет:*"
)

CHOOSE_SUBJECT_AREA = "🧠 Для генерации нового теста:\n📚 *Выберите предмет:*"

MANUAL_AREA = (
    "✍🏻 *Введите предметную область*\n"
    "Например:\n"
    "- 🎬 Кинематограф\n"
    "- 🏀 Спорт"
)

MANUAL_SUBJECT = (
    "✍🏻 *Введите предмет*\n"
    "Например:\n"
    "- 💃🏼 Естествознание\n"
    "- 🌏 Мировая экономика"
)

MANUAL_GRADE = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n\n"
    "✍🏻 *Введите сложность теста:*\n"
    "Например:\n"
    "- 🧑🏻‍🎓 Математический факультет 4 курс бакалавриата\n"
    "- 🧒🏻 Дошкольная программа\n\n"
    
    "❗ Вводите необходимый уровень сложности полностью ❗"
)

CHOOSE_SUBJECT = (
    "📘 *Выберите предмет*, по которому вы хотите сгенерировать тест:"
)

CHOOSE_THEME = (
    "📘 Предмет: {subject}\n\n"
    "✍🏻 *Введите тему теста*\n"
    "Например:\n"
    "- 🐍 рептилии\n"
    "- ⚔️ столетняя война"
)

CHOOSE_GRADE = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n\n"
    "🎯 *Выберите сложность теста:*"
)

CHOOSE_FORMAT_RESPONSE = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n\n"
    "🗂️ *Выберите формат ответов:*"
)

CHOOSE_ANSWER_NUM = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n\n"
    "🔠 *Выберите количество вариантов ответа:*"
)

CHOOSE_QUESTION_NUM = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n\n"
    "🔢 *Выберите количество вопросов в тесте:*"
)

CHOOSE_QUESTION_NUM_WITH_ANSWER_NUM = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n"
    "☑️ Количетсво вариантов ответа:  {answer_num}\n\n"
    "🔢 *Выберите количество вопросов в тесте:*"
)

CHOOSE_QUESTION_NUM_WITH_ANSWER_NUM_AND_PERCENT = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n"
    "☑️ Количетсво вариантов ответа:  {answer_num}\n"
    "📊 Процент открытых вопросов:  {mixed_percent}%\n\n"
    "🔢 *Выберите количество вопросов в тесте:*"
)

CHOOSE_PERCENT_FORMAT_RESPONSE = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n"
    "☑️ Количетсво вариантов ответа:  {answer_num}\n\n"
    "📊 *Выберите % открытых вопросов:*\n_(остальные будут с вариантами ответов)_"
)

FINISHED_TEST = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n"
    "🔢 Количество вопросов:  {question_num}\n\n"
    "✅ *Ваш тест готов!*\n"
    "*Выберите формат файла:*"
)

FINISHED_TEST_WITH_ANSWER_NUM = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n"
    "☑️ Количетсво вариантов ответа:  {answer_num}\n"
    "🔢 Количество вопросов:  {question_num}\n\n"
    "✅ *Ваш тест готов!*\n"
    "*Выберите формат файла:*"
)

FINISHED_TEST_WITH_ANSWER_NUM_AND_PERCENT = (
    "📘 Предмет: {subject}\n"
    "🔎 Тема: {theme}\n"
    "🎯 Сложность: {grade}\n"
    "🗂️ Формат ответов: {format_response}\n"
    "☑️ Количетсво вариантов ответа:  {answer_num}\n"
    "📊 Процент открытых вопросов:  {mixed_percent}%\n"
    "🔢 Количество вопросов:  {question_num}\n\n"
    "✅ *Ваш тест готов!*\n"
    "*Выберите формат файла:*"
)

ERROR_MESS = "⚠️ Произошла ошибка ⚠️\n Попробуйте еще раз."
